1s/ERP/Conf/InformationRegisters/Лико_ПараметрыПроизводстваЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ПараметрыПроизводстваЗаказа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетрыНаНастройку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетрыНаБрак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаНастройку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаСменуРоликов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкоростьПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетражДляРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доходность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьПечатиНФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКликов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рентабельность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тираж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетражКвМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыНаОснастку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаБрак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаРолика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНаНастройкуСерии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетрыНаНастройкуСерии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штампы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.Лико_Спецификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВарианта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЦеныГруппНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЦеныГруппНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотериНаРезке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экосбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_РегистраторыЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРасчетЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаНормативов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/ВариантыОформленияУслугДокументовПереработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОформленияУслугДокументовПереработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УказываютсяВЗаказеОтчете</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформляютсяОтдельно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ГруппировкиЗатратВЗаказеПереработчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ГруппировкиЗатратВЗаказеПереработчику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезГруппировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПродукцииИНазначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСпецификациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСпецификациямИНазначениям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНаПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭтапамПроизводства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СпособыРаспределенияЗатратНаВыходныеИзделия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияЗатратНаВыходныеИзделия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДолямСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПлановойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВесу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОбъему</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКоличеству</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ПорядокРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыЗаказовПереработчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовПереработчикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/CommonModules/Лико_ПрограммноеСозданиеДокументовСправочников/Ext/Module.bsl
Функция СоздатьРедактироватьЗаказПереработчику(Заказ,МассивДанных,Отказ) Экспорт //+Лико m.shenderov 01.12.2022

	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивДанных) Тогда
		МассивДанных=ПодготовитьДанныеДляПереработкиПоЗаказу(Заказ);
	КонецЕсли;
	
	
	
	
	
	//Заказ Переработчику
	ОрганизацияЗаказаПереработчика =  Лико_Дополнительно.ПолучитьОрганизациюПоКонтрагенту(Заказ.Контрагент);
	ЖелаемаяДатаОтгрузки =  ?(Заказ.датаОтгрузки>=ТекущаяДата(),Заказ.датаОтгрузки,ТекущаяДата()) ;
	
		
	
	Результат =МассивДанных[0].Выбрать();
	Результат.Следующий();
	
	Если  Не ЗначениеЗаполнено(ОрганизацияЗаказаПереработчика) Тогда
		
		Если ЗначениеЗаполнено(Результат.Ссылка) Тогда			
			
			ЗаказПереработчику = Результат.ссылка.ПолучитьОбъект();
			ЗаказПереработчику.ПометкаУдаления=Истина; 
			
			Попытка 
				
				ЗаказПереработчику.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Возврат ЗаказПереработчику.Ссылка;
				
			Исключение
				
				Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось создать заказы давальца и переработчику. Заказ не отправлен в работу. " + ОписаниеОшибки());
				ОтменитьТранзакцию();
				Отказ = Истина;
				Возврат Неопределено;
				
			КонецПопытки;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли;
	

	Если ЗначениеЗаполнено(Результат.Ссылка) Тогда 
		ЗаказПереработчику = Результат.ссылка.ПолучитьОбъект();
		ЗаказПереработчику.ПометкаУдаления = Ложь;
	Иначе
		ЗаказПереработчику = Документы.ЗаказПереработчику.СоздатьДокумент();
		ЗаказПереработчику.Дата = Заказ.Дата;
	КонецЕсли;
	стрэт = Заказ.Товары[0];
	АдресПриемки = УправлениеСвойствами.ЗначениеСвойства(ОрганизацияЗаказаПереработчика,"Лико_ЗонаПриемкиСИМ");
	
	ОсновнойСклад =  АдресПриемки.Владелец;

	
	//ОсновнойСклад 								= Справочники.Склады.НайтиПоНаименованию("ЛК Основной");
	ЗаказПереработчику.Организация 				= ОрганизацияЗаказаПереработчика;
	Контрагент 									= УправлениеСвойствами.ЗначениеСвойства(Заказ.Площадка.Организация, Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитОрганизацииКонтрагентОрганизации.ЗначениеПараметра); 	
	ЗаказПереработчику.Партнер 					= Контрагент.Партнер;
	ЗаказПереработчику.Контрагент 				= Контрагент;
	ЗаказПереработчику.ДокументОснование 		= Заказ;
	ЗаказПереработчику.УслугиПоПереработке 		= Перечисления.ВариантыОформленияУслугДокументовПереработки.УказываютсяВЗаказеОтчете;
	ЗаказПереработчику.ГруппировкаЗатрат 		= Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки;
	ЗаказПереработчику.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
	ЗаказПереработчику.ХозяйственнаяОперация 	= Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика;
	
	//Договор 									= Справочники.Лико_ПредопределенныеЗначения.ДоговоСПереработчикомЛикофлексИксПак.ЗначениеПараметра;
	Договор										= ПолучитьДоговорПереработки(МассивДанных[4].Выгрузить(),Перечисления.ТипыДоговоров.СПереработчиком);	
	
	ЗаказПереработчику.Договор 					= Договор;
	ЗаказПереработчику.Автор					= Пользователи.ТекущийПользователь();
	ЗаказПереработчику.Валюта 					= Договор.ВалютаВзаиморасчетов;
	ЗаказПереработчику.ЖелаемаяДатаПоступления 	= ЖелаемаяДатаОтгрузки;
	ЗаказПереработчику.ЗакупкаПодДеятельность 	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ЗаказПереработчику.Менеджер 				= Заказ.Менеджер;
	ЗаказПереработчику.подразделение 			= УправлениеСвойствами.ЗначениеСвойства(Заказ.Площадка.Организация, Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитОрганизацииПодразделениеПроизводство.ЗначениеПараметра); 	
	ЗаказПереработчику.ПорядокРасчетов 			= Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	ЗаказПереработчику.ОплатаВВалюте 			= Договор.ОплатаВВалюте;
	ЗаказПереработчику.Статус 					= Перечисления.СтатусыЗаказовПереработчикам.КИсполнению;
	ЗаказПереработчику.Приоритет 				= Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	НоменклатураУслуги 							= Справочники.Лико_ПредопределенныеЗначения.НоменклатураУслугиОбработки.ЗначениеПараметра;
	ЗаказПереработчику.Номенклатура 			= НоменклатураУслуги;
	ЗаказПереработчику.ГруппаФинансовогоУчета 	= НоменклатураУслуги.ВидНоменклатуры.ГруппаФинансовогоУчета;
	ЗаказПереработчику.СтатьяКалькуляции 		= Справочники.Лико_ПредопределенныеЗначения.СтатьяУслугиОбработки.ЗначениеПараметра;
	ЗаказПереработчику.СпособДоставки 			= перечисления.СпособыДоставки.Самовывоз;
	ЗаказПереработчику.ВариантПриемкиТоваров 	= Константы.ВариантПриемкиТоваров.Получить(); 
	
	
	ЗаказПереработчику.Материалы.Очистить();
	
	Результат = МассивДанных[2].Выбрать();
	Результат.Следующий();
	стрмат 						= ЗаказПереработчику.Материалы.Добавить();
	стрмат.номенклатура 		= Заказ.ОсновнойМатериал;
	стрмат.характеристика 		= Справочники.ЯССМ_Нарезки.ХарактеристикаПоНарезке(Заказ.Нарезка);
	стрмат.упаковка 			= Заказ.ОсновнойМатериал.ЕдиницаИзмерения;
	стрмат.КоличествоУпаковок 	= Результат.МетражКВМ;
	стрмат.количество 			= Результат.МетражКВМ;
	стрмат.Цена 				= Результат.Цена;
	стрмат.сумма 				= стрэт.КоличествоУпаковок* стрмат.Цена;
	стрмат.Склад 				= ОсновнойСклад;
	стрмат.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.КОбеспечению;
	стрмат.СтатьяКалькуляции 	= Справочники.Лико_ПредопределенныеЗначения.СтатьяКалькуляцииПечати.ЗначениеПараметра;
	стрмат.ДатаОтгрузки 		= ЖелаемаяДатаОтгрузки; 
	
	
	ВыборкаДоп = МассивДанных[3].Выбрать();
	Пока ВыборкаДоп.Следующий() Цикл 
		
		стрмат 						= ЗаказПереработчику.Материалы.Добавить();
		стрмат.номенклатура			= ВыборкаДоп.Материал;
		стрмат.характеристика 		= Справочники.ЯССМ_Нарезки.ХарактеристикаПоНарезке(ВыборкаДоп.Нарезка);
		стрмат.упаковка 			= ВыборкаДоп.Материал.ЕдиницаИзмерения;
		стрмат.КоличествоУпаковок 	= Результат.МетражДляРЦ*ВыборкаДоп.НарезкаРазмер/1000;
		стрмат.количество 			= стрмат.КоличествоУпаковок;
		стрмат.Цена 				= ВыборкаДоп.Цена;
		стрмат.сумма 				= стрэт.КоличествоУпаковок* стрмат.Цена;
		стрмат.Склад 				= ОсновнойСклад;
		стрмат.ВариантОбеспечения 	= Перечисления.ВариантыОбеспечения.КОбеспечению;
		стрмат.СтатьяКалькуляции 	= Справочники.Лико_ПредопределенныеЗначения.СтатьяКалькуляцииПечати.ЗначениеПараметра;
		стрмат.ДатаОтгрузки 		= ЖелаемаяДатаОтгрузки;
		
	КонецЦикла;
	
	
	
	ЗаказПереработчику.Продукция.Очистить();
	
	стр 						= ЗаказПереработчику.Продукция.Добавить();
	стр.Номенклатура 			= стрэт.Номенклатура;
	стр.Характеристика 			= стрэт.Характеристика;
	стр.Упаковка 				= стрэт.Упаковка;
	стр.КоличествоУпаковок 		= стрэт.КоличествоУпаковок;
	стр.Количество 				= стрэт.Количество;
	стр.КоличествоУпаковок 		= стрэт.КоличествоУпаковок;
	стр.ДоляСтоимости 			= 1;
	стр.Лико_Втулка 			= стрэт.внутреннийдиаметр;
	стр.ДатаПоступления 		= ЖелаемаяДатаОтгрузки;
	стр.Получатель 				= ОсновнойСклад;//Лико_Дополнительно.НайтиСкладРегиона(Заказ.Регион);
	
	//стр.Лико_КолРоликов = стрэт.;
	
	ЗаказПереработчику.СтавкаНДС 		= стрэт.СтавкаНДС;
	ЗаказПереработчику.СуммаНДС 		= стрэт.СуммаНДС;
	ЗаказПереработчику.Сумма 			= стрэт.Сумма-стрэт.СуммаНДС;		
	ЗаказПереработчику.СуммаСНДС 		= стрэт.СуммаСНДС;
	ЗаказПереработчику.СуммаДокумента 	= стрэт.СуммаСНДС;
	
	ЗаказПереработчику.Услуги.Очистить();
	
	Попытка 
		ЗаказПереработчику.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ЗаказПереработчику.Ссылка;	
	Исключение
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось создать заказы давальца и переработчику. Заказ не отправлен в работу. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Отказ = Истина;
		Возврат Неопределено;
	КонецПопытки;	
	
КонецФункции //-Лико m.shenderov 01.12.2022 

Функция СоздатьРедактироватьЗаказДавальца(Заказ,МассивДанных,Отказ ) Экспорт //+Лико m.shenderov 01.12.2022
	
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МассивДанных) Тогда
		МассивДанных=ПодготовитьДанныеДляПереработкиПоЗаказу(Заказ);
	КонецЕсли;
	

	
	ЖелаемаяДатаОтгрузки =  ?(Заказ.датаОтгрузки>=ТекущаяДата(),Заказ.датаОтгрузки,ТекущаяДата()) ;
	НоменклатураУслуги 							= Справочники.Лико_ПредопределенныеЗначения.НоменклатураУслугиОбработки.ЗначениеПараметра;
	
	
	АдресПриемки = УправлениеСвойствами.ЗначениеСвойства(Заказ.площадка.Организация,"Лико_ЗонаПриемкиСИМ");
	
	ОсновнойСклад =  АдресПриемки.Владелец;

	
	//ОсновнойСклад 								= Справочники.Склады.НайтиПоНаименованию("ЛК Основной");

	
	Результат = МассивДанных[1].Выбрать();
	
	Результат.Следующий();
	Если ЗначениеЗаполнено(Результат.Ссылка) Тогда 
		ЗаказДавальца = Результат.ссылка.ПолучитьОбъект();
		ЗаказДавальца.ПометкаУдаления = ЛОжь;
	Иначе
		ЗаказДавальца = Документы.ЗаказДавальца.СоздатьДокумент();
		ЗаказДавальца.Лико_ЗаказКлиента = Заказ;
		ЗаказДавальца.Дата = Заказ.Дата;
	КонецЕсли;
	
	ЗаказДавальца.автор 							= Пользователи.ТекущийПользователь();
	ЗаказДавальца.Партнер 							= Заказ.Партнер;
	ЗаказДавальца.Контрагент 						= Заказ.Контрагент;
	ЗаказДавальца.Организация 						= Заказ.площадка.Организация;
	ЗаказДавальца.склад 							= ОсновнойСклад;
	ЗаказДавальца.складПоступления 					= ОсновнойСклад;
	//ДоговорДавальца 								= НайтиСоздатьДоговорПереработчикаДавальца(Заказ.площадка, Заказ.Контрагент, Перечисления.ТипыДоговоров.СДавальцем);  
	ДоговорДавальца									= ПолучитьДоговорПереработки(МассивДанных[4].Выгрузить(),Перечисления.ТипыДоговоров.СДавальцем);
	ЗаказДавальца.Договор 							= ДоговорДавальца;
	ЗаказДавальца.Валюта 							= ДоговорДавальца.ВалютаВзаиморасчетов;
	ЗаказДавальца.Менеджер 							= Заказ.Менеджер;
	ЗаказДавальца.ЦенаВключаетНДС 					= Заказ.ЦенаВключаетНДС;
	ЗаказДавальца.Статус 							= Перечисления.СтатусыЗаказовДавальцев.КПроизводству;
	ЗаказДавальца.ЖелаемаяДатаПоступления 			= ЖелаемаяДатаОтгрузки;
	ЗаказДавальца.согласован 						= Истина;
	ЗаказДавальца.ХозяйственнаяОперация 			= Перечисления.ХозяйственныеОперации.ПроизводствоИзДавальческогоСырья;
	ЗаказДавальца.Номенклатура 						= НоменклатураУслуги;
	ЗаказДавальца.ГруппаФинансовогоУчета  			= НоменклатураУслуги.ВидНоменклатуры.ГруппаФинансовогоУчета;
	ЗаказДавальца.приоритет 						= Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	ЗаказДавальца.СпособДоставки 					= перечисления.СпособыДоставки.Самовывоз;
	ЗаказДавальца.подразделение 					= УправлениеСвойствами.ЗначениеСвойства(Заказ.Площадка.Организация, Справочники.Лико_ПредопределенныеЗначения.ДопРеквизитОрганизацииПодразделениеПроизводство.ЗначениеПараметра); 	
	ЗаказДавальца.ТипПроизводственногоПроцесса 		= Перечисления.ТипыПроизводственныхПроцессов.Сборка;
	ЗаказДавальца.НалогообложениеНДС 				= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ЗаказДавальца.Содержание 						= "Изготовление полуфабриката из материала заказчика";
	ЗаказДавальца.ВариантПриемкиТоваров 			= Перечисления.ВариантыПриемкиТоваров.МожетПроисходитьБезЗаказовИНакладных;
	ЗаказДавальца.УправлениеПроизводством2_2 		= Истина;
	
	стрэт = Заказ.Товары[0];
	ЗаказДавальца.ставкаНДС = стрЭт.СтавкаНДС;
	
	
	ЗаказДавальца.Материалы.Очистить(); 
	
	Результат = МассивДанных[2].Выбрать();
	Результат.Следующий();

	
	стрмат 						= ЗаказДавальца.Материалы.Добавить();
	стрмат.номенклатура 		= Заказ.ОсновнойМатериал;
	стрмат.характеристика 		= Справочники.ЯССМ_Нарезки.ХарактеристикаПоНарезке(Заказ.Нарезка);
	//стрмат.упаковка 			= Справочники.ЯССМ_Нарезки.УпаковкаПоНарезке(Заказ.Нарезка);
	стрмат.КоличествоУпаковок 	= Результат.МетражКВМ;
	стрмат.количество 			= Результат.МетражКВМ;
	стрмат.Цена 				= Результат.Цена;
	стрмат.сумма 				= стрэт.КоличествоУпаковок* стрмат.Цена;
	стрмат.Склад 				= ОсновнойСклад;
	стрмат.ДатаПоступления      = ЖелаемаяДатаОтгрузки;
	
	
	
	ВыборкаДоп = МассивДанных[3].Выбрать();
	Пока ВыборкаДоп.Следующий() Цикл
		
		стрмат 								= ЗаказДавальца.Материалы.Добавить();
		стрмат.номенклатура 				= ВыборкаДоп.Материал;
		стрмат.характеристика 				= Справочники.ЯССМ_Нарезки.ХарактеристикаПоНарезке(ВыборкаДоп.Нарезка);
		стрмат.упаковка 					= стрмат.упаковка 	= ВыборкаДоп.Материал.ЕдиницаИзмерения;
		стрмат.КоличествоУпаковок 			= Результат.МетражДляРЦ*ВыборкаДоп.НарезкаРазмер/1000;
		стрмат.количество 					= стрмат.КоличествоУпаковок;
		стрмат.Цена 						= ВыборкаДоп.Цена;
		стрмат.сумма 						= стрэт.КоличествоУпаковок* стрмат.Цена;
		стрмат.Склад 						= ОсновнойСклад;
		стрмат.ДатаПоступления 				= ЖелаемаяДатаОтгрузки;
	КонецЦикла;
	
	
	
	
	ЗаказДавальца.Продукция.Очистить();
	
	стр 								= ЗаказДавальца.Продукция.Добавить();
	стр.Номенклатура 					= стрэт.Номенклатура;
	стр.Характеристика 					= стрэт.Характеристика;
	стр.Упаковка 						= стрэт.Упаковка;
	стр.КоличествоУпаковок 				= стрэт.КоличествоУпаковок;
	стр.Количество 						= стрэт.Количество;
	стр.КоличествоУпаковок 				= стрэт.КоличествоУпаковок;
	стр.ДатаОтгрузки 					= ЖелаемаяДатаОтгрузки;
	стр.склад 							= ЗаказДавальца.склад;
	стр.ВариантОбеспечения 				= Перечисления.ВариантыОбеспечения.НеТребуется;
	стр.Цена 							= стрэт.цена;
	стр.СуммаСобственныхМатериалов 		= 0;//стрмат.сумма;
	стр.суммауслуги 					= стрэт.Сумма;
	стр.сумма 							= стр.СуммаСобственныхМатериалов+стр.суммауслуги;
	стр.СуммаНДС  						= стрэт.СуммаНДС;
	стр.СуммаСНДС 						= стрэт.СуммаСНДС;
	
	
	
	ЗаказДавальца.СуммаДокумента =стр.СуммаСНДС;
	
	Попытка 
		ЗаказДавальца.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ЗаказДавальца.Ссылка; 
	Исключение
		Лико_ДополнительноКлиентСервер.СообщитьДляКлиента("Не удалось создать заказы давальца и переработчику. Заказ не отправлен в работу. " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Отказ = Истина;
		Возврат Неопределено;
	КонецПопытки;	
	
	
	
КонецФункции //-Лико m.shenderov 01.12.2022 

Функция СоздатьРедактироватьЗаказНаПроизводство(Заказ,ЗаказДавальца,Отказ) Экспорт  //+Лико m.shenderov 01.12.2022
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли; 
			
	
	//Проверяем, есть ли Заказ на производство
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаПроизводство2_2.Ссылка КАК ЗаказНаПроизводство
	|ИЗ
	|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство2_2
	|ГДЕ
	|	ЗаказНаПроизводство2_2.ДокументОснование = &Заказ";
	Запрос.УстановитьПараметр("Заказ", ЗаказДавальца.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Если  ЗначениеЗаполнено(Результат.ЗаказНаПроизводство) Тогда 
		ЗаказПрОбъект = Результат.ЗаказНаПроизводство.ПолучитьОбъект();
	Иначе
		ЗаказПРОбъект = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
	КонецЕсли;
	
	Лико_Планирование.ЗаполнитьПоЗаказуКлиента(ЗаказПрОбъект, Заказ, ЗаказДавальца.ссылка);
	
	Если Не Отказ Тогда 
		Возврат ЗаказПрОбъект.Ссылка;
	Иначе 
		Возврат  Неопределено;
	КонецЕсли;
	
КонецФункции //-Лико m.shenderov 01.12.2022 



Функция ПолучитьДоговорПереработки(ТзДоговоров,ТипДоговора) //+Лико m.shenderov 11.12.2022
	
	
	стрДоговора=ТзДоговоров.Найти(ТипДоговора,"ТипДоговора");
	Если стрДоговора<>Неопределено Тогда
		 Возврат стрДоговора.Ссылка;
	КонецЕсли;

КонецФункции //-Лико m.shenderov 11.12.2022 

 Функция ПодготовитьДанныеДляПереработкиПоЗаказу(Заказ) //+Лико m.shenderov 01.12.2022
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПереработчику.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПереработчику КАК ЗаказПереработчику
	|ГДЕ
	|	ЗаказПереработчику.ДокументОснование = &Заказ
	//|	И ЗаказПереработчику.Организация = &ОрганизацияПереработчика		
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	ЗаказДавальца.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказДавальца КАК ЗаказДавальца
	|ГДЕ
	|	ЗаказДавальца.Лико_ЗаказКлиента = &Заказ
	//|	И ЗаказДавальца.Организация = &Организация
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ * Лико_ПараметрыПроизводстваЗаказа.Нарезка.Размер / 1000) КАК МетражКВМ,
	|	МАКСИМУМ(ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0)) КАК Цена,
	|	МАКСИМУМ(Лико_ПараметрыПроизводстваЗаказа.МетражДляРЦ) КАК МетражДляРЦ
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПроизводстваЗаказа КАК Лико_ПараметрыПроизводстваЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО Лико_ПараметрыПроизводстваЗаказа.Заказ.ОсновнойМатериал.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|ГДЕ
	|	Лико_ПараметрыПроизводстваЗаказа.Заказ = &Заказ
	|	И Лико_ПараметрыПроизводстваЗаказа.НомерПроката = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаВидыРабот.ВидРабот КАК ВидРабот,
	|	ЗаказКлиентаВидыРабот.Материал КАК Материал,
	|	ЗаказКлиентаВидыРабот.Нарезка КАК Нарезка,
	|	ЗаказКлиентаВидыРабот.ЭтикетокВПодаче КАК ЭтикетокВПодаче,
	|	ЗаказКлиентаВидыРабот.Дополнительно КАК Дополнительно,
	|	ЕСТЬNULL(Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЗаказКлиентаВидыРабот.Нарезка.Размер, 0) КАК НарезкаРазмер
	|ИЗ
	|	Документ.ЗаказКлиента.ВидыРабот КАК ЗаказКлиентаВидыРабот
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ОсновнаяЕвро)
	|					И Площадка = &ПлощадкаЛикофлекс) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних
	|		ПО ЗаказКлиентаВидыРабот.Материал.ЦеноваяГруппа = Лико_ЦеныГруппНоменклатурыСрезПоследних.ЦеноваяГруппа
	|ГДЕ
	|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
	|	И ЗаказКлиентаВидыРабот.ДавальческоеСырье = ИСТИНА 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ТипДоговора КАК ТипДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &ОрганизацияЗаказаПереработчика
	|	И ДоговорыКонтрагентов.Контрагент = &КонтрагентЗаказаПереработчика
	|	И ДоговорыКонтрагентов.ТипДоговора = Значение(Перечисление.ТипыДоговоров.СПереработчиком)
	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.ТипДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.ТипДоговора = Значение(Перечисление.ТипыДоговоров.СДавальцем)";
	
	
	ОрганизацияЗаказаПереработчика 	=  	Лико_Дополнительно.ПолучитьОрганизациюПоКонтрагенту(Заказ.Контрагент);
	КонтрагентЗаказаПереработчика 	= 	УправлениеСвойствами.ЗначениеСвойства(Заказ.площадка.Организация,"КонтрагентОрганизации_8e3f712fdca94791a890e1aa7853a0d2") ;
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ОрганизацияЗаказаПереработчика", ОрганизацияЗаказаПереработчика);  
	Запрос.УстановитьПараметр("КонтрагентЗаказаПереработчика", КонтрагентЗаказаПереработчика); 
	Запрос.УстановитьПараметр("Валюта", Заказ.ВалютаДляДокументов);
	Запрос.УстановитьПараметр("Контрагент", Заказ.Контрагент); 
	
	
	Запрос.УстановитьПараметр("Организация", Заказ.площадка.Организация);
	Запрос.УстановитьПараметр("ПлощадкаЛикофлекс", Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра);
	
	Возврат Запрос.ВыполнитьПакет();
	
	
КонецФункции //-Лико m.shenderov 01.12.2022
